Revit 2026 API

# TableDataIsEqual Method

---

Checks if this element is equal in value to the other element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsEqual(
	TableData OtherElem
)
```
```vb
Public Function IsEqual (
	OtherElem As TableData
) As Boolean
```
```cpp
public:
bool IsEqual(
	TableData^ OtherElem
)
```
```fsharp
member IsEqual :
        OtherElem : TableData -> bool
```

#### Parameters

OtherElem TableData

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

TableData Class

Autodesk.Revit.DB Namespace